{
    "abstract": "In mixed multi-view data, multiple sets of diverse features are measured on the same set of samples.  By integrating all available data sources, we seek to discover common group structure among the samples that may be hidden in individualistic cluster analyses of a single data view. While several techniques for such integrative clustering have been explored, we propose and develop a convex formalization that enjoys strong empirical performance and inherits the mathematical properties of increasingly popular convex clustering methods. Specifically, our Integrative Generalized Convex Clustering Optimization (iGecco) method employs different convex distances, losses, or divergences for each of the different data views with a joint convex fusion penalty that leads to common groups.  Additionally, integrating mixed multi-view data is often challenging when each data source is high-dimensional.  To perform feature selection in such scenarios, we develop an adaptive shifted group-lasso penalty that selects features by shrinking them towards their loss-specific centers.  Our so-called iGecco+ approach selects features from each data view that are best for determining the groups, often leading to improved integrative clustering.  To solve our problem, we develop a new type of generalized multi-block ADMM algorithm using sub-problem approximations that more efficiently fits our model for big data sets.  Through a series of numerical experiments and real data examples on text mining and genomics, we show that iGecco+ achieves superior empirical performance for high-dimensional mixed multi-view data.",
    "authors": [
        "Minjie Wang",
        "Genevera I. Allen"
    ],
    "emails": [
        "mw50@rice.edu",
        "gallen@rice.edu"
    ],
    "id": "19-1012",
    "issue": 55,
    "pages": [
        1,
        73
    ],
    "title": "Integrative Generalized Convex Clustering Optimization and Feature Selection for Mixed Multi-View Data",
    "volume": 22,
    "year": 2021
}