{
    "abstract": "Existing work in translation demonstrated the potential of massively multilingual machine translation by training a single model able to translate between any pair of languages. However, much of this work is English-Centric, training only on data which was translated from or to English.While this is supported by large sources of training data, it does not reflect translation needs worldwide. In this work, we create a true Many-to-Many multilingual translation model that can translate directly between any pair of 100 languages. We build and open-source a training data set that covers thousands of language directions with parallel data, created through large-scale mining. Then, we explore how to effectively increase model capacity through a combination of dense scaling and language-specific sparse parameters to create high quality models. Our focus on non-English-Centric models brings gains of more than 10 BLEU when directly translating between non-English directions while performing competitively to the best single systems from the Workshop  on Machine Translation (WMT). We open-source our scripts so that others may reproduce the data, evaluation, and final M2M-100 model.",
    "authors": [
        "Angela Fan",
        "Shruti Bhosale",
        "Holger Schwenk",
        "Zhiyi Ma",
        "Ahmed El-Kishky",
        "Siddharth Goyal",
        "Mandeep Baines",
        "Onur Celebi",
        "Guillaume Wenzek",
        "Vishrav Chaudhary",
        "Naman Goyal",
        "Tom Birch",
        "Vitaliy Liptchinsky",
        "Sergey Edunov",
        "Michael Auli",
        "Armand Joulin"
    ],
    "emails": [
        "angelafan@fb.com",
        "shru@fb.com",
        "schwenk@fb.com",
        "mazhiyi@fb.com",
        "ahelk@fb.com",
        "sidgoyal@fb.com",
        "msb@fb.com",
        "celebio@fb.com",
        "guw@fb.com",
        "vishrav@fb.com",
        "namangoyal@fb.com",
        "tbirch@fb.com",
        "vitaliy888@fb.com",
        "edunov@fb.com",
        "michaelauli@fb.com",
        "ajoulin@fb.com"
    ],
    "extra_links": [
        [
            "code",
            "https://github.com/pytorch/fairseq/tree/master/examples/m2m_100"
        ]
    ],
    "id": "20-1307",
    "issue": 107,
    "pages": [
        1,
        48
    ],
    "title": "Beyond English-Centric Multilingual Machine Translation",
    "volume": 22,
    "year": 2021
}